-- +goose Up
INSERT INTO categories (name, type, icon) VALUES
    -- Income categories
    ('Зарплата', 'income', '💼'),
    ('Фриланс', 'income', '💻'),
    ('Инвестиции', 'income', '📈'),
    ('Подарки', 'income', '🎁'),
    ('Продажа', 'income', '💰'),
    ('Другое', 'income', '📦'),
    
    -- Expense categories
    ('Продукты', 'expense', '🛒'),
    ('Выплаты по кредитам', 'expense',''),
    ('Транспорт', 'expense', '🚗'),
    ('Жилье', 'expense', '🏠'),
    ('Коммунальные услуги', 'expense', '💡'),
    ('Здоровье', 'expense', '🏥'),
    ('Развлечения', 'expense', '🎮'),
    ('Образование', 'expense', '📚'),
    ('Одежда', 'expense', '👔'),
    ('Кафе и рестораны', 'expense', '🍽️'),
    ('Путешествия', 'expense', '✈️'),
    ('Спорт', 'expense', '⚽'),
    ('Связь', 'expense', '📱'),
    ('Подарки', 'expense', '🎁'),
    ('Другое', 'expense', '📦');

-- +goose Down
DELETE FROM categories;

